"use strict";










// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 2
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\

// let age = 25;
// const PI = 3.14;

// age += 3;
// console.log(age, PI);











// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 3
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\

// let name = "Murat",
//     age = 20,
//     isStudent = true,
//     favoritColor = null;

// console.log(favoritColor);













// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 4
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\

// let num = 10;
// let str = String(num);

// alert(str);
// let userName = prompt("Пожалуйста, введите ваше имя", "ВВЕДИ, УРОД");
// let isConfirmd = confirm("Вы получили по ебалу?")

// console.log(isConfirmd, typeof(isConfirmd)); //Эта функция все введенные значения приводит к строке 














// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 5
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\

// let x = 10,
//     y = 5;

// let sum = x + y,
//     product = x *y;

// ++x;
// --y;

// console.log(sum, product, x, y);



// let vvedi = prompt("Введи три цифры через запятую");

// let x = vvedi.split(', '), 
//     otvet = '';

// console.log(x);


// for (let c = 0; c < 3; c++){
//     otvet += x[c]
// };

// otvet = +otvet;

// console.log(otvet, typeof(otvet));

















// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 6
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\

// let x = prompt('Введи число');

// x = +x;

// if (x == 10){
//     console.log(`Твоё число ${x} равно 10!`);
// } 
//  else if (x > 10) {
//     console.log(`Твоё число ${x} больше 10!`);
// }
// else{
//     console.log(`Твоё число ${x} меньше 10!`);
// }

// let dayOfWeek = prompt("Введи число недели");

// dayOfWeek = +dayOfWeek;

// switch (dayOfWeek) {
//     case 1:
//         console.log("Это понедельник");
//         break;
//     case 2:
//         console.log("Это вторник");
//         break;
//     case 3:
//         console.log("Это среда");
//         break;
//     case 4:
//         console.log("Это четверг");
//         break;
//     case 5:
//         console.log("Это пятница");
//         break;
//     case 6:
//         console.log("Это суббота");
//         break;
//     case 7:
//         console.log("Это воскресенье");
//         break;

//     default:
//         console.log("Это конец света");
//         break;
// }














// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 7
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\

// for (let i = 1; i <= 10; ++i){
//     console.log(i);
// }

// let x = 10;

// while (x>0) {
//     console.log(x);
//     --x;
// }   



//  ________________________________________
// let x;

// do {
//     x = prompt("Введи число");
//     x = +x;
// } while (x <= 100);



// _____________________________________________
// let age = prompt("Введите свой возраст");

// age = +age;

// if (age >= 18 && age <= 30) {
//     console.log("Вы отвечаете требованиям возраста");
    
// } else {
//     console.log("Вы не соответствуете требованиям возраста");
// }



// _____________________________________________
// let num = prompt("Введи любое число");
 
// let Arr = num.split('');

// let result_arr = new Array();


// console.log(Arr, typeof(Arr));

// let j = 0;

// for (let i = 0; i < Arr.length; i++) {
    
//     if (Arr[i] != 2 && Arr[i] != 7){
//         result_arr[j++] = Arr[i];
//     }
// }

// console.log(result_arr);



// _____________________________________________
// let x;
// let result = 1;


// do {
//     x = prompt("Enter a number:");
//     x = +x;
//     if (x > 0){
//         result *= x; 
//     }
// } while(x != 0);

// console.log(result);








// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 8
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\



// _____________________Выполнено________________________
// function greet(name = "Гость"){

//     if (name == '' || name == ' ') name = "Гость";
      
//     return `Привет, ${name}`;
// }

// let namae;

// console.log(greet(namae));



// _____________________Выполнено________________________
// function calculateArea(width, height = 10){
//     if (width < 0) width = -width;
//     if (height < 0) height = -height;
//     return `Площадь прямоульника равна: ${width*height}`;
// }

// let response = calculateArea(8, -4);
// console.log(response);



// _____________________Выполнено________________________
// function greet (name, age = 18) {
//     if (name === undefined) name = "Незнакомец";
//     return `Привет, ${name}, которому ${age} лет!`;
// }

// let response = greet('Astik', 90);

// console.log(response);



// _____________________Выполнено________________________
// function commpareStrings(str_1, str_2) {

//     if (str_1.length > str_2.length){
//         return `Строка ${str_1} больше чем ${str_2}`;
//     } else if (str_1.length < str_2.length) {
//         return `Строка ${str_2} больше чем ${str_1}`; 
//     } else {
//         return "Эти строки равны";
//     }
// }

// let a = 'Один',
//     b = 'Тринадцать';

// console.log(commpareStrings(a, b));



// _____________________Выполнено________________________

// function checkGrade(grade) {
//     switch (grade){

//         case 1:
//             console.log('Студент лох');
//         break;

//         case 2:
//             console.log('Студент двоечник');
//         break;

//         case 3:
//             console.log('Студент троечник');
//         break;

//         case 4:
//             console.log('Студент четвёрочник');
//         break;

//         case 5:
//             console.log('Студент отличник');
//         break;

//         default:
//             console.log('Студент никто');
//         break;
        

        
        
//     }

// }


// checkGrade();






// ----------------------------------------------------- \\
// ----------------------------------------------------- \\
// Задача 9
// ----------------------------------------------------- \\
// ----------------------------------------------------- \\


let x = 5;

let y;

y = (x > 10) ? 18:9;

console.log(y);
